In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
df = pd.read_excel('products_export.xlsx', dtype=str)
df.head()

,name,current_quantity,price,wholesale_price,wholesale_quantity,barcode
0,Aba tanque nxr 09/12 pto inj 09/12 west 357090.0,0,62.08,58,4,NaN
1,Aba tanque nxr 09/12 vrm caucaia 09/10 357107.0,0,62.08,58,4,NaN
2,Aba tanque nxr 150 13/14 pto 210629,0,90,80,4,7899988705907
3,Aba tanque nxr 150 14 verm 210631,0,90,0,0,7899988705945
4,Aba tanque phoenix jet,0,38,36,4,NaN

In [3]:
df = df.drop(columns=['current_quantity', 'wholesale_quantity', 'wholesale_price'], axis=1)
df['id_category'] = '1'
df.head()

,name,current_quantity,price,wholesale_price,wholesale_quantity,id_category
0,Aba tanque nxr 09/12 pto inj 09/12 west 357090.0,0,62.08,58,4,1
1,Aba tanque nxr 09/12 vrm caucaia 09/10 357107.0,0,62.08,58,4,1
2,Aba tanque nxr 150 13/14 pto 210629,0,90,80,4,1
3,Aba tanque nxr 150 14 verm 210631,0,90,0,0,1
4,Aba tanque phoenix jet,0,38,36,4,1

In [4]:
df.rename(columns={'barcode': 'sku'})
df.head()

,name,current_quantity,price,wholesale_price,wholesale_quantity,id_category
0,Aba tanque nxr 09/12 pto inj 09/12 west 357090.0,0,62.08,58,4,1
1,Aba tanque nxr 09/12 vrm caucaia 09/10 357107.0,0,62.08,58,4,1
2,Aba tanque nxr 150 13/14 pto 210629,0,90,80,4,1
3,Aba tanque nxr 150 14 verm 210631,0,90,0,0,1
4,Aba tanque phoenix jet,0,38,36,4,1

In [7]:
engine = create_engine('postgresql+psycopg2://userdev:admin@localhost:5432/api_java')

df = df.rename(columns={'name': 'description'})

df.to_sql(
    name='items',
    con=engine,
    schema='private',
    if_exists='append',
    index=False
)

544